In [1]:
#import necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as snsa

## Read and Explore the dataset

In [2]:
#read in the dataset
df = pd.read_csv('data/titanic.csv')

In [3]:
# show th etop 5 rows od the dataset
df.head()

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
## Clean the name field 
# family name
# title
# first name
# middle name
# maiden name

In [4]:
df.shape

(891, 11)

In [5]:
#list of variables/columns
df.columns

Index(['survived', 'pclass', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [ ]:
#Data Dictionary:
# survived - survived or not (0  = did not survive, 1 = survived)
# p class ( 1= upper class, 2 = middle class, 3 = lower class)
# name (last name, first middel (maiden))
# gender (female, or male)
# age 
# sibsp	- number of siblings and spouses aboard the ship
# parch - number of parents or children aboard the ship
# ticket - ticket number
# fare - ticket price or fair (in what units? euro? pounds?)
# cabin - cabin number
# embarked - port of embarkation:
#       - C = cherbourg
#       - Q = Queenstown
#       - S = Southampton

In [6]:
df['survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [8]:
# **** very useful method! 

df.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   name      891 non-null    object
 3   gender    891 non-null    object
 4   age       714 non-null    float64
 5   sibsp     891 non-null    int64
 6   parch     891 non-null    int64
 7   ticket    891 non-null    object
 8   fare      891 non-null    float64
 9   cabin     204 non-null    object
 10  embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [10]:
# pclass
df.pclass.value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [11]:
df.gender.unique()

array(['male', 'female'], dtype=object)

In [12]:
df.gender.value_counts()

male      577
female    314
Name: gender, dtype: int64

In [14]:
df.cabin.nunique()

147

In [18]:
for col in df:
    print(col, df[col].nunique())

survived 2
pclass 3
name 891
gender 2
age 88
sibsp 7
parch 7
ticket 681
fare 248
cabin 147
embarked 3

In [ ]:
df = pd.read_csv('data/titanic.csv')

for col in df:
    print(col, df[col].nunique())


# Represent the above output using a dictionary comprehension (col as key, nunique as value) 

# Print the unique values of every column if the number of unique values in that column is 10 or less.

In [20]:
# Represent the above output using a list comprehension of tuples 
[(col, df[col].nunique()) for col in df]

[('survived', 2),
 ('pclass', 3),
 ('name', 891),
 ('gender', 2),
 ('age', 88),
 ('sibsp', 7),
 ('parch', 7),
 ('ticket', 681),
 ('fare', 248),
 ('cabin', 147),
 ('embarked', 3)]

In [21]:
titanic_dict = {}
for col in df:
    titanic_dict[col] = df[col].nunique()

In [22]:
titanic_dict

{'survived': 2,
 'pclass': 3,
 'name': 891,
 'gender': 2,
 'age': 88,
 'sibsp': 7,
 'parch': 7,
 'ticket': 681,
 'fare': 248,
 'cabin': 147,
 'embarked': 3}

In [23]:
{col:df[col].nunique() for col in df}

{'survived': 2,
 'pclass': 3,
 'name': 891,
 'gender': 2,
 'age': 88,
 'sibsp': 7,
 'parch': 7,
 'ticket': 681,
 'fare': 248,
 'cabin': 147,
 'embarked': 3}

In [27]:
# Print the unique values of every column if the number of unique values in that column is 10 or less.
for col in df:
    if df[col].nunique() <= 10:
        print(col,df[col].unique())

survived [0 1]
pclass [3 1 2]
gender ['male' 'female']
sibsp [1 0 3 4 2 5 8]
parch [0 1 2 5 3 4 6]
embarked ['S' 'C' 'Q' nan]

In [28]:
# check the size of the dataset
df.shape

(891, 11)

In [29]:
# check if and how many duplicate rows we have (based on the name column)
df.name.duplicated().sum()

0

In [30]:

df.name.nunique()

891

In [33]:
df.ticket.duplicated().sum()

210

In [34]:
df.isnull().sum()

survived      0
pclass        0
name          0
gender        0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      2
dtype: int64

## Missing Values

- 15% you can drop << I think 15% is too much to drop and it should depden on the case
- Always note and justify your decision to drop/impute
- find out what the true values are (ask the source)
- ignore them
- drop the observations
- drop the columns (if 90% or more is empty)
- imputation (average, mode, ML model, ..)
- do some resarch

In [ ]:
# e.g. patient health data, demographic and health data about patients. missing values in heights:
 #   - makes more sense to fill in the missing values with the average of the patients
 #  with the most similar information

 # - ML as imputation methods (KNN, Linear Regression, ..etc)

In [ ]:
# choose the average
# delete
# leave it

# subjectivity alert
# age - mean
# cabin - delete, drop the column, 
# embarked - mode or leave, check for families (sibsp, parch) 
#            and see where they embarked

In [35]:
df.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

Since the cabin column is mostly empty with 700 null values, I decided to drop this column for now ....

In [37]:
#dealing with the embarked columna
# df['embarked'].fillna('S', inplace= True)

# OR

df['embarked'] = df['embarked'].fillna('S')

In [38]:
df.embarked.isnull().sum()

0

In [41]:
#cabin column
df.drop('cabin', axis =1, inplace=True)

In [42]:
df

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [43]:
# addressing the age empty values
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [44]:
df.age.mean()

29.69911764705882

In [45]:
df.age.fillna(df.age.mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [46]:
df.groupby('gender')['age'].describe()

        count       mean        std   min   25%   50%   75%   max
gender
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0

In [55]:
df.groupby('gender').agg(['mean', 'count', 'std', 'var']).T.style

In [56]:
# show which rows have missing values in any column
df[df.isnull().any(axis=1)]

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,embarked
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
17,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S
19,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,C
26,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Q
...,...,...,...,...,...,...,...,...,...,...
859,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C
863,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,S
868,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S
878,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S

In [58]:
# would like to fill in the empty values in the age column using
# the mean based on the gender/group

# find the rows for passengers with missing in age column and "male" in gender column

df[(df.age.isnull() & (df.gender == 'male'))]

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,embarked
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
17,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S
26,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C
29,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,S
36,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,C
...,...,...,...,...,...,...,...,...,...,...
839,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C
846,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,S
859,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C
868,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S
878,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S

In [62]:
print(len(df[(df.age.isnull() & (df.gender == 'male'))]), 
len(df[(df.age.isnull() & (df.gender == 'female'))]))

124 53

In [ ]:
# fill the missing values using the mean age of the specific group (gender)

In [64]:
df.groupby(['gender', 'pclass'])['age'].count()

gender  pclass
female  1          85
        2          74
        3         102
male    1         101
        2          99
        3         253
Name: age, dtype: int64